# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [6]:
first =  pd.Series(np.random.randint(1, high=5, size=100))
second = pd.Series(np.random.randint(1, high=4, size=100))
third = pd.Series(np.random.randint(100000, high=300000, size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [ ]:
df = pd.concat([first, second, third], axis=1)
# df.head()

   0  1       2
0  4  2  203445
1  2  3  144571
2  4  1  127312
3  3  3  192259
4  2  2  164901

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [ ]:
df.rename(columns = {0: 'bedrs',1: 'bathrs',2: 'price_sqr_meter'}, inplace=True)
# df.head()

   bedrs  bathrs  price_sqr_meter
0      4       2           203445
1      2       3           144571
2      4       1           127312
3      3       3           192259
4      2       2           164901

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [17]:
bigcolumn = pd.concat([first, second, third], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

         0
0        4
1        2
2        4
3        3
4        2
..     ...
95  200991
96  216412
97  134560
98  166241
99  179872

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [18]:
# no the index are kept but the length of the DataFrame is 300
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [21]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn.tail()

          0
295  200991
296  216412
297  134560
298  166241
299  179872